Experiments/CylinderDNS/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0.5 0 -0.5)
    (1 0 -0.5)
    (18 0 -0.5)
    (18 0.707107 -0.5)
    (0.707107 0.707107 -0.5)
    (0.353553 0.353553 -0.5)
    (0 0.5 -0.5)
    (0 1 -0.5)
    (0 2 -0.5)
    (0.707107 2 -0.5)
    (18 2 -0.5)
    (-0.353553 0.353553 -0.5)
    (-0.707107 0.707107 -0.5)
    (-0.707107 2 -0.5)
    (-2 2 -0.5)
    (-2 0.707107 -0.5)
    (-2 0 -0.5)
    (-1 0 -0.5)
    (-0.5 0 -0.5)
    (18 -0.707107 -0.5)
    (0.707107 -0.707107 -0.5)
    (0.353553 -0.353553 -0.5)
    (0 -0.5 -0.5)
    (0 -1 -0.5)
    (0 -2 -0.5)
    (0.707107 -2 -0.5)
    (18 -2 -0.5)
    (-0.353553 -0.353553 -0.5)
    (-0.707107 -0.707107 -0.5)
    (-0.707107 -2 -0.5)
    (-2 -2 -0.5)
    (-2 -0.707107 -0.5)
    (0.5 0 0.5)
    (1 0 0.5)
    (18 0 0.5)
    (18 0.707107 0.5)
    (0.707107 0.707107 0.5)
    (0.353553 0.353553 0.5)
    (0 0.5 0.5)
    (0 1 0.5)
    (0 2 0.5)
    (0.707107 2 0.5)
    (18 2 0.5)
    (-0.353553 0.353553 0.5)
    (-0.707107 0.707107 0.5)
    (-0.707107 2 0.5)
    (-2 2 0.5)
    (-2 0.707107 0.5)
    (-2 0 0.5)
    (-1 0 0.5)
    (-0.5 0 0.5)
    (18 -0.707107 0.5)
    (0.707107 -0.707107 0.5)
    (0.353553 -0.353553 0.5)
    (0 -0.5 0.5)
    (0 -1 0.5)
    (0 -2 0.5)
    (0.707107 -2 0.5)
    (18 -2 0.5)
    (-0.353553 -0.353553 0.5)
    (-0.707107 -0.707107 0.5)
    (-0.707107 -2 0.5)
    (-2 -2 0.5)
    (-2 -0.707107 0.5)
);


blocks
(
    hex (6 5 4 7 38 37 36 39) (10 10 1) simpleGrading (1 1 1)
    hex (0 1 4 5 32 33 36 37) (10 10 1) simpleGrading (1 1 1)
    hex (1 2 3 4 33 34 35 36) (380 10 1) simpleGrading (1 1 1)
    hex (4 3 10 9 36 35 42 41) (380 20 1) simpleGrading (1 1 1)
    hex (7 4 9 8 39 36 41 40) (10 20 1) simpleGrading (1 1 1)
    hex (11 6 7 12 43 38 39 44) (10 10 1) simpleGrading (1 1 1)
    hex (17 18 11 12 49 50 43 44) (10 10 1) simpleGrading (1 1 1)
    hex (16 17 12 15 48 49 44 47) (20 10 1) simpleGrading (1 1 1)
    hex (15 12 13 14 47 44 45 46) (20 20 1) simpleGrading (1 1 1)
    hex (12 7 8 13 44 39 40 45) (10 20 1) simpleGrading (1 1 1)
    hex (23 20 21 22 55 52 53 54) (10 10 1) simpleGrading (1 1 1)
    hex (21 20 1 0 53 52 33 32) (10 10 1) simpleGrading (1 1 1)
    hex (20 19 2 1 52 51 34 33) (380 10 1) simpleGrading (1 1 1)
    hex (25 26 19 20 57 58 51 52) (380 20 1) simpleGrading (1 1 1)
    hex (24 25 20 23 56 57 52 55) (10 20 1) simpleGrading (1 1 1)
    hex (28 23 22 27 60 55 54 59) (10 10 1) simpleGrading (1 1 1)
    hex (28 27 18 17 60 59 50 49) (10 10 1) simpleGrading (1 1 1)
    hex (31 28 17 16 63 60 49 48) (20 10 1) simpleGrading (1 1 1)
    hex (30 29 28 31 62 61 60 63) (20 20 1) simpleGrading (1 1 1)
    hex (29 24 23 28 61 56 55 60) (10 20 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 5 (0.469846 0.17101 -0.5)
    arc 5 6 (0.17101 0.469846 -0.5)
    arc 1 4 (0.939693 0.34202 -0.5)
    arc 4 7 (0.34202 0.939693 -0.5)
    arc 11 18 (-0.469846 0.17101 -0.5)
    arc 6 11 (-0.17101 0.469846 -0.5)
    arc 12 17 (-0.939693 0.34202 -0.5)
    arc 7 12 (-0.34202 0.939693 -0.5)
    arc 0 21 (0.469846 -0.17101 -0.5)
    arc 21 22 (0.17101 -0.469846 -0.5)
    arc 1 20 (0.939693 -0.34202 -0.5)
    arc 20 23 (0.34202 -0.939693 -0.5)
    arc 18 27 (-0.469846 -0.17101 -0.5)
    arc 22 27 (-0.17101 -0.469846 -0.5)
    arc 17 28 (-0.939693 -0.34202 -0.5)
    arc 23 28 (-0.34202 -0.939693 -0.5)
    arc 32 37 (0.469846 0.17101 0.5)
    arc 37 38 (0.17101 0.469846 0.5)
    arc 33 36 (0.939693 0.34202 0.5)
    arc 36 39 (0.34202 0.939693 0.5)
    arc 43 50 (-0.469846 0.17101 0.5)
    arc 38 43 (-0.17101 0.469846 0.5)
    arc 44 49 (-0.939693 0.34202 0.5)
    arc 39 44 (-0.34202 0.939693 0.5)
    arc 32 53 (0.469846 -0.17101 0.5)
    arc 53 54 (0.17101 -0.469846 0.5)
    arc 33 52 (0.939693 -0.34202 0.5)
    arc 52 55 (0.34202 -0.939693 0.5)
    arc 50 59 (-0.469846 -0.17101 0.5)
    arc 54 59 (-0.17101 -0.469846 0.5)
    arc 49 60 (-0.939693 -0.34202 0.5)
    arc 55 60 (-0.34202 -0.939693 0.5)
);

boundary
(
    up
    {
        type wall;
        faces
        (
            (8 9 41 40)
            (9 10 42 41)
            (13 8 40 45)
            (14 13 45 46)
        );
    }
    down
    {
        type wall;
        faces
        (
            (24 25 57 56)
            (25 26 58 57)
            (29 24 56 61)
            (30 29 61 62)
        );
    }
    right
    {
        type patch;
        faces
        (
            (3 10 42 35)
            (2 3 35 34)
            (19 2 34 51)
            (26 19 51 58)
        );
    }
    left
    {
        type patch;
        faces
        (
            (15 14 46 47)
            (16 15 47 48)
            (31 16 48 63)
            (30 31 63 62)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (0 5 37 32)
            (5 6 38 37)
            (6 11 43 38)
            (11 18 50 43)
            (18 27 59 50)
            (27 22 54 59)
            (22 21 53 54)
            (21 0 32 53)
        );
    }
);

mergePatchPairs
(
);
