Experiments/CylinderDNS/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    down
    {
        type noSlip;
    }

    right
    {
        type zeroGradient;
    }

    up
    {
        type noSlip;
    }

    left
    {
        type uniformFixedValue;
        uniformValue constant (1 0.1 0);
    }

    cylinder
    {
        type noSlip;
    }

    defaultFaces
    {
        type empty;
    }
}
