Experiments/CylinderDNS/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    down
    {
        type zeroGradient;
    }

    right
    {
        type fixedValue;
        value uniform 0;
    }

    up
    {
        type zeroGradient;
    }

    left
    {
        type zeroGradient;
    }

    cylinder
    {
        type zeroGradient;
    }

    defaultFaces
    {
        type empty;
    }
}
